In [1]:
#creating a dataframe from missing data
import numpy as np
import pandas as pd

In [2]:
data_dict={'A':[1,2, np.nan,4,np.nan],
          'B':[np.nan, np.nan, np.nan, np.nan, np.nan],
         'C':[11,12,13,14,15],
         'D':[16,np.nan,18,19,20]}
df=pd.DataFrame(data_dict)#dataframe from a dictionary

In [3]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [5]:
#isnull(),isna(),notnull()-check the missing data from the dataset

In [6]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [7]:
df.isnull().sum()
#find out  the number of null value in the column

A    2
B    5
C    0
D    1
dtype: int64

In [8]:
df.isnull().sum().sum()
#fint out total number of sum of the dataset

8

In [9]:
df['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [10]:
df.isna()
#this function is same as isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [11]:
df.loc[1].isnull().sum()
#find out the null value from the row by usinf "loc"

2

In [13]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [14]:
df.shape

(5, 4)

In [15]:
df.notnull().sum().sum()

12

In [16]:
df.loc[1].notnull().sum()

2

In [17]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [18]:
df.mean()

A     2.333333
B          NaN
C    13.000000
D    18.250000
dtype: float64

In [22]:
df['A'].mean()

2.3333333333333335

In [21]:
df.loc[0].mean()

9.333333333333334

dropna(),fillna()-cleaning/filling the missing data

In [23]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [24]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [25]:
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [26]:
df.dropna(thresh=2,axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

we can use fillna() to fill the value
inplaced=True for parmanent change

In [27]:
df.fillna(value='a')

     A  B   C     D
0  1.0  a  11  16.0
1  2.0  a  12     a
2    a  a  13  18.0
3  4.0  a  14  19.0
4    a  a  15  20.0

In [28]:
df['A'].fillna(value=df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [29]:
df['B'].fillna(value=df['B'].mean())

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: B, dtype: float64

In [32]:
df.fillna(method='ffill')

C:\Users\USER\AppData\Local\Temp\ipykernel_6964\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [33]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [34]:
df.fillna(method='bfill')

C:\Users\USER\AppData\Local\Temp\ipykernel_6964\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [35]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [37]:
df.fillna(0,inplace=True)

In [38]:
df

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0